number = int(input('Укажите количество журавликов: '))

print(f'Катя изготовила: {(number // 3) * 2}')
print(f'Петя и Cережа изготовили по: {(number // 3) // 2}')